In [1]:
# cleaning 'NaN'

import pandas as pd
import numpy as np
from pandas import Series, DataFrame

s = Series([10,20, np.nan, 40, 50])
s

0    10.0
1    20.0
2     NaN
3    40.0
4    50.0
dtype: float64

In [2]:
# fillna method
s.fillna(5)

0    10.0
1    20.0
2     5.0
3    40.0
4    50.0
dtype: float64

In [3]:
s.fillna(s.mean())

0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
dtype: float64

In [6]:
# dropna

s.dropna()

0    10.0
1    20.0
3    40.0
4    50.0
dtype: float64

In [9]:
# Missing Weather

s = Series([19,22,22,np.nan,19,22,np.nan,22,19,np.nan],
          index='Tue Wed Thu Fri Sat Sun Mon Tue Wed Thu'.split())

Tue    19.0
Wed    22.0
Thu    22.0
Fri     NaN
Sat    19.0
Sun    22.0
Mon     NaN
Tue    22.0
Wed    19.0
Thu     NaN
dtype: float64

In [10]:
s.fillna(s.mean())

Tue    19.000000
Wed    22.000000
Thu    22.000000
Fri    20.714286
Sat    19.000000
Sun    22.000000
Mon    20.714286
Tue    22.000000
Wed    19.000000
Thu    20.714286
dtype: float64

In [11]:
s.fillna(s.median())

Tue    19.0
Wed    22.0
Thu    22.0
Fri    22.0
Sat    19.0
Sun    22.0
Mon    22.0
Tue    22.0
Wed    19.0
Thu    22.0
dtype: float64

In [12]:
s.dropna()

Tue    19.0
Wed    22.0
Thu    22.0
Sat    19.0
Sun    22.0
Tue    22.0
Wed    19.0
dtype: float64

In [14]:
np.random.seed(0)
df = DataFrame(np.random.randint(-500, 500, [3,4]),
               index=list('abc'),
               columns=list('wxyz'))
df

     w    x    y    z
a  184   59  129 -308
b  335  263  207 -141
c -491  223 -223  254

In [16]:
df.loc['a', 'w'] = np.nan
df.loc['a', 'y'] = np.nan
df.loc['c', 'y'] = np.nan
df

       w    x      y    z
a    NaN   59    NaN -308
b  335.0  263  207.0 -141
c -491.0  223    NaN  254

In [18]:
df.fillna(9999)

        w    x       y    z
a  9999.0   59  9999.0 -308
b   335.0  263   207.0 -141
c  -491.0  223  9999.0  254

In [19]:
df.mean()

w    -78.000000
x    181.666667
y    207.000000
z    -65.000000
dtype: float64

In [21]:
df.fillna(df.mean())

       w    x      y    z
a  -78.0   59  207.0 -308
b  335.0  263  207.0 -141
c -491.0  223  207.0  254

In [24]:
df.fillna({'w':9999, 'y':df['y'].mean()})

        w    x      y    z
a  9999.0   59  207.0 -308
b   335.0  263  207.0 -141
c  -491.0  223  207.0  254

In [25]:
df

       w    x      y    z
a    NaN   59    NaN -308
b  335.0  263  207.0 -141
c -491.0  223    NaN  254

In [27]:
df.dropna()

       w    x      y    z
b  335.0  263  207.0 -141

In [29]:
# kwargs to dropna()

# 1. thresh, integer indicating threshold of good values we need to have
# 2. subset, list of column names (strings) we want to look at when determining if we should drop the row
# if a column is not in subset, it will not be dropped

df.dropna(thresh=3)

       w    x      y    z
b  335.0  263  207.0 -141
c -491.0  223    NaN  254

In [34]:
df.dropna(subset=['w','z'])
# NaN in row 'y' is kept because its outside of the subset

       w    x      y    z
b  335.0  263  207.0 -141
c -491.0  223    NaN  254

In [41]:
# Exercise: Boston temp

filename = '../data/boston,ma.csv'
df = pd.read_csv(filename)
df

,date_time,"boston,ma_maxtempC","boston,ma_mintempC","boston,ma_totalSnow_cm","boston,ma_sunHour","boston,ma_uvIndex","boston,ma_uvIndex.1","boston,ma_moon_illumination","boston,ma_moonrise","boston,ma_moonset",...,"boston,ma_WindChillC","boston,ma_WindGustKmph","boston,ma_cloudcover","boston,ma_humidity","boston,ma_precipMM","boston,ma_pressure","boston,ma_tempC","boston,ma_visibility","boston,ma_winddirDegree","boston,ma_windspeedKmph"
0,2018-12-11 00:00:00,1,-4,0.0,8.7,2,0,21,10:19 AM,08:12 PM,...,-3,10,0,57,0.0,1022,-3,10,339,8
1,2018-12-11 03:00:00,1,-4,0.0,8.7,2,0,21,10:19 AM,08:12 PM,...,-1,7,2,57,0.0,1023,-3,10,319,6
2,2018-12-11 06:00:00,1,-4,0.0,8.7,2,0,21,10:19 AM,08:12 PM,...,-5,8,4,60,0.0,1023,-4,10,334,7
3,2018-12-11 09:00:00,1,-4,0.0,8.7,2,2,21,10:19 AM,08:12 PM,...,1,3,6,49,0.0,1022,-1,10,334,3
4,2018-12-11 12:00:00,1,-4,0.0,8.7,2,2,21,10:19 AM,08:12 PM,...,4,6,2,44,0.0,1018,1,10,229,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
723,2019-03-11 09:00:00,8,2,0.0,8.7,2,2,32,08:44 AM,10:48 PM,...,0,28,13,74,0.0,1004,4,10,261,21
724,2019-03-11 12:00:00,8,2,0.0,8.7,2,2,32,08:44 AM,10:48 PM,...,1,28,28,68,0.0,1003,5,10,263,19
725,2019-03-11 15:00:00,8,2,0.0,8.7,2,3,32,08:44 AM,10:48 PM,...,4,31,31,62,0.0,1004,6,10,268,20
726,2019-03-11 18:00:00,8,2,0.0,8.7,2,0,32,08:44 AM,10:48 PM,...,6,33,36,60,0.0,1010,7,10,265,21
727,2019-03-11 21:00:00,8,2,0.0,8.7,2,0,32,08:44 AM,10:48 PM,...,0,36,9,66,0.0,1012,4,10,271,20